app/views/restaurants/index.html.erb

SELECT "tags".* FROM "tags"  WHERE (LOWER(name) = LOWER('ají'))
---
		<td><%= restaurant.category %></td>
		<td class="tag_list"><%= raw restaurant.tag_list.map { |t| link_to t, tag_path(t) }.join(', ') %></td>