app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" JOIN taggings restaurants_taggings_5851673  ON restaurants_taggings_5851673.taggable_id = restaurants.id AND restaurants_taggings_5851673.taggable_type = 'Restaurant' AND restaurants_taggings_5851673.tag_id = 10
SELECT "tags".* FROM "tags"  WHERE (LOWER(name) = LOWER('ají'))
---
  def index
	if params[:tag]
		@restaurants = Restaurant.tagged_with(params[:tag])
	else
		@restaurants = Restaurant.all

INSERT INTO "restaurants" ("category", "created_at", "lat", "logo_content_type", "logo_file_name", "logo_file_size", "logo_updated_at", "lon", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
	@restaurant = Restaurant.new(restaurant_params)

	respond_to do |format|
	  if @restaurant.save

UPDATE "restaurants" SET "logo_content_type" = ?, "logo_file_name" = ?, "logo_file_size" = ?, "logo_updated_at" = ?, "updated_at" = ? WHERE "restaurants"."id" = 7
---
  def update
	respond_to do |format|
	  if @restaurant.update(restaurant_params)

SELECT "restaurants".* FROM "restaurants" JOIN taggings restaurants_taggings_fe8bbd6  ON restaurants_taggings_fe8bbd6.taggable_id = restaurants.id AND restaurants_taggings_fe8bbd6.taggable_type = 'Restaurant' AND restaurants_taggings_fe8bbd6.tag_id = 20
SELECT "tags".* FROM "tags"  WHERE (LOWER(name) = LOWER('ají'))
SELECT COUNT(*) FROM "restaurants" JOIN taggings restaurants_taggings_fe8bbd6  ON restaurants_taggings_fe8bbd6.taggable_id = restaurants.id AND restaurants_taggings_fe8bbd6.taggable_type = 'Restaurant' AND restaurants_taggings_fe8bbd6.tag_id = 20
---
  def search
    @restaurants = Restaurant.tagged_with(params[:search])

    if @restaurants.empty?